//=====================================================================
//文件名称：model_Preprocess_Gary.h
//功能概要：模型驱动构件源文件
//制作单位：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//版    本：  2020-08-09  V1.0
//适用芯片：STM32
//=====================================================================
#ifndef MODELPREPROCESS_H_
#define MODELPREPROCESS_H_


#include "headfile.h"
#include "modelPredict.h"

//=====================================================================
//函数名称：rgb565togray_256
//函数返回：gray：转换后的灰阶
//参数说明：color：转换前的16位RGB565格式像素点
//功能概要：将RGB565格式转换为lcd可以显示的256阶的灰度格式。
//=====================================================================
uint8_t rgb565togray_256(uint16_t color);

//=====================================================================
//函数名称:Model_GetInputImg
//函数返回:处理成功返回1
//参数说明:	 image:56*56大小的16位彩色图像
//		   output:推理模型的输入8位灰度图像
//功能概要:灰度图像下采样
//=====================================================================
int Model_GetInputImg(uint16_t* image,image_28 output);

//=====================================================================
//函数名称：Input_Normalization
//函数返回：无
//参数说明: 输入 3*32*32 处理  3*28*28  返回float类型 3*32*32  
//功能概要：数据归一化处理
//=====================================================================
void Model_Normalization(image_28 input,float image_normalized[1][28][28]);



#endif /* MODELPREPROCESS_H_ */
